HoangPhuc02/S32K144_CAN_Project/lib/driver/can/can_reg.h
/**
 * @file    can_reg.h
 * @brief   CAN Register Definitions for S32K144
 * @details This file contains register definitions and bit field macros for the CAN module.
 *          CAN is a full CAN controller that supports CAN 2.0A/B protocol.
 * 
 * The S32K144 has 3 CAN modules:
 * - CAN0: 32 Message Buffers, Base address 0x40024000
 * - CAN1: 32 Message Buffers, Base address 0x40025000
 * - CAN2: 32 Message Buffers, Base address 0x4002B000
 * 
 * Key Features:
 * - CAN 2.0A (Standard 11-bit ID) and 2.0B (Extended 29-bit ID) support
 * - Bit rates up to 1 Mbps
 * - 32 configurable Message Buffers for TX/RX operations
 * - Hardware message filtering with RX FIFO or Individual Mask registers
 * - Self-reception disable mode for testing
 * - Listen-Only mode for bus monitoring
 * - Programmable TX arbitration scheme
 * - Programmable error counters and error states
 * 
 * @author  PhucPH32
 * @date    30/11/2025
 * @version 1.0
 * 
 * @note    Refer to S32K1xx Reference Manual Chapter 52 (CAN) for detailed information
 * @warning Clock must be enabled and pins configured before using CAN module
 * 
 * @par Change Log:
 * - Version 1.0 (30/11/2025): Initial CAN driver implementation
 */

#ifndef CAN_REG_H
#define CAN_REG_H

/*******************************************************************************
 * Includes
 ******************************************************************************/
#include <stdint.h>
#ifndef __IO
	#define   __I     volatile const       	 /*!< Defines 'read only' permissions     */
	#define     __O     volatile             /*!< Defines 'write only' permissions    */
	#define     __IO    volatile             /*!< Defines 'read / write' permissions  */
#endif


/*******************************************************************************
 * Definitions
 ******************************************************************************/

/** @brief Base addresses of CAN modules */
#define CAN0_BASE           (0x40024000UL)  /**< CAN0 base address */
#define CAN1_BASE           (0x40025000UL)  /**< CAN1 base address */
#define CAN2_BASE           (0x4002B000UL)  /**< CAN2 base address */




/** FLEXCAN - Size of Registers Arrays */
#define FLEXCAN_RAMn_COUNT                        128u
#define FLEXCAN_RXIMR_COUNT                       32u
#define FLEXCAN_WMB_COUNT                         4u

/** @brief Number of RX FIFO ID Filter elements (when RX FIFO is enabled) */
#define CAN_RX_FIFO_ID_FILTERS  (128U)



/*******************************************************************************
 * CAN Register Structures
 ******************************************************************************/
/**
 * @brief CAN Module Register Structure
 * @details Complete register map for CAN module including:
 *          - Configuration registers (MCR, CTRL1, CTRL2)
 *          - Status registers (ESR1, ESR2, ECR)
 *          - Interrupt control (IMASK1, IFLAG1)
 *          - 32 Message Buffers (MB[0]-MB[31])
 *          - Individual RX Mask registers (RXIMR[0]-RXIMR[31])
 */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration Register, offset: 0x0 */
  __IO uint32_t CTRL1;                             /**< Control 1 Register, offset: 0x4 */
  __IO uint32_t TIMER;                             /**< Free Running Timer, offset: 0x8 */
  uint8_t RESERVED_0[4];
  __IO uint32_t RXMGMASK;                          /**< Rx Mailboxes Global Mask Register, offset: 0x10 */
  __IO uint32_t RX14MASK;                          /**< Rx 14 Mask Register, offset: 0x14 */
  __IO uint32_t RX15MASK;                          /**< Rx 15 Mask Register, offset: 0x18 */
  __IO uint32_t ECR;                               /**< Error Counter, offset: 0x1C */
  __IO uint32_t ESR1;                              /**< Error and Status 1 Register, offset: 0x20 */
  uint8_t RESERVED_1[4];
  __IO uint32_t IMASK1;                            /**< Interrupt Masks 1 Register, offset: 0x28 */
  uint8_t RESERVED_2[4];
  __IO uint32_t IFLAG1;                            /**< Interrupt Flags 1 Register, offset: 0x30 */
  __IO uint32_t CTRL2;                             /**< Control 2 Register, offset: 0x34 */
  __I  uint32_t ESR2;                              /**< Error and Status 2 Register, offset: 0x38 */
  uint8_t RESERVED_3[8];
  __I  uint32_t CRCR;                              /**< CRC Register, offset: 0x44 */
  __IO uint32_t RXFGMASK;                          /**< Rx FIFO Global Mask Register, offset: 0x48 */
  __I  uint32_t RXFIR;                             /**< Rx FIFO Information Register, offset: 0x4C */
  __IO uint32_t CBT;                               /**< CAN Bit Timing Register, offset: 0x50 */
  uint8_t RESERVED_4[44];
  __IO uint32_t RAMn[FLEXCAN_RAMn_COUNT];          /**< Embedded RAM, array offset: 0x80, array step: 0x4 */
  uint8_t RESERVED_5[1536];
  __IO uint32_t RXIMR[FLEXCAN_RXIMR_COUNT];        /**< Rx Individual Mask Registers, array offset: 0x880, array step: 0x4 */
  uint8_t RESERVED_6[512];
  __IO uint32_t CTRL1_PN;                          /**< Pretended Networking Control 1 Register, offset: 0xB00 */
  __IO uint32_t CTRL2_PN;                          /**< Pretended Networking Control 2 Register, offset: 0xB04 */
  __IO uint32_t WU_MTC;                            /**< Pretended Networking Wake Up Match Register, offset: 0xB08 */
  __IO uint32_t FLT_ID1;                           /**< Pretended Networking ID Filter 1 Register, offset: 0xB0C */
  __IO uint32_t FLT_DLC;                           /**< Pretended Networking DLC Filter Register, offset: 0xB10 */
  __IO uint32_t PL1_LO;                            /**< Pretended Networking Payload Low Filter 1 Register, offset: 0xB14 */
  __IO uint32_t PL1_HI;                            /**< Pretended Networking Payload High Filter 1 Register, offset: 0xB18 */
  __IO uint32_t FLT_ID2_IDMASK;                    /**< Pretended Networking ID Filter 2 Register / ID Mask Register, offset: 0xB1C */
  __IO uint32_t PL2_PLMASK_LO;                     /**< Pretended Networking Payload Low Filter 2 Register / Payload Low Mask register, offset: 0xB20 */
  __IO uint32_t PL2_PLMASK_HI;                     /**< Pretended Networking Payload High Filter 2 low order bits / Payload High Mask register, offset: 0xB24 */
  uint8_t RESERVED_7[24];
  struct {                                         /* offset: 0xB40, array step: 0x10 */
    __I  uint32_t WMBn_CS;                           /**< Wake Up Message Buffer register for C/S, array offset: 0xB40, array step: 0x10 */
    __I  uint32_t WMBn_ID;                           /**< Wake Up Message Buffer Register for ID, array offset: 0xB44, array step: 0x10 */
    __I  uint32_t WMBn_D03;                          /**< Wake Up Message Buffer Register for Data 0-3, array offset: 0xB48, array step: 0x10 */
    __I  uint32_t WMBn_D47;                          /**< Wake Up Message Buffer Register Data 4-7, array offset: 0xB4C, array step: 0x10 */
  } WMB[FLEXCAN_WMB_COUNT];
  uint8_t RESERVED_8[128];
  __IO uint32_t FDCTRL;                            /**< CAN FD Control Register, offset: 0xC00 */
  __IO uint32_t FDCBT;                             /**< CAN FD Bit Timing Register, offset: 0xC04 */
  __I  uint32_t FDCRC;                             /**< CAN FD CRC Register, offset: 0xC08 */
} CAN_Type;
