HoangPhuc02/S32K144_CAN_Project/lib/driver/can/can_reg.h
/*******************************************************************************
 * CAN Instance Pointers
 ******************************************************************************/

/** @brief CAN0 peripheral instance base pointer */
#define CAN0                ((CAN_Type *)CAN0_BASE)

/** @brief CAN1 peripheral instance base pointer */
#define CAN1                ((CAN_Type *)CAN1_BASE)

/** @brief CAN2 peripheral instance base pointer */
#define CAN2                ((CAN_Type *)CAN2_BASE)


/*******************************************************************************
 * Clock Source Selection
 ******************************************************************************/

/**
 * @brief CAN Clock Source Selection
 * @details Defines available clock sources for CAN peripheral.
 *          The selected clock source determines the CAN bit timing.
 *          Common clock frequencies:
 *          - SOSC DIV2: 8 MHz / 2 = 4 MHz (if 8 MHz crystal)
 *          - SIRC DIV2: 8 MHz / 2 = 4 MHz (internal slow clock)
 *          - FIRC DIV2: 48 MHz / 2 = 24 MHz (internal fast clock)
 *          - SPLL DIV2: 80 MHz / 2 = 40 MHz (if PLL configured for 80 MHz)
 */
typedef enum {
    CAN_CLK_SRC_SOSCDIV2 = 0U,  /**< System Oscillator DIV2 clock */
	// TODO: pending cannot set using busclock
    CAN_CLK_SRC_BUSCLOCK = 1U,  /**< Bus Internal Reference Clock DIV2 */
} can_clk_src_t;


/*******************************************************************************
 * CAN Register Bit Fields
 ******************************************************************************/

#define CAN_MCR_MAXMB_MASK                   (0x7FU)
#define CAN_MCR_MAXMB_SHIFT                  (0U)
#define CAN_MCR_MAXMB_WIDTH                  (7U)
#define CAN_MCR_MAXMB(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_MCR_MAXMB_SHIFT)) & CAN_MCR_MAXMB_MASK)

#define CAN_MCR_IDAM_MASK                    (0x300U)
#define CAN_MCR_IDAM_SHIFT                   (8U)
#define CAN_MCR_IDAM_WIDTH                   (2U)
#define CAN_MCR_IDAM(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_MCR_IDAM_SHIFT)) & CAN_MCR_IDAM_MASK)

#define CAN_MCR_FDEN_MASK                    (0x800U)
#define CAN_MCR_FDEN_SHIFT                   (11U)
#define CAN_MCR_FDEN_WIDTH                   (1U)
#define CAN_MCR_FDEN(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_MCR_FDEN_SHIFT)) & CAN_MCR_FDEN_MASK)

#define CAN_MCR_AEN_MASK                     (0x1000U)
#define CAN_MCR_AEN_SHIFT                    (12U)
#define CAN_MCR_AEN_WIDTH                    (1U)
#define CAN_MCR_AEN(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_MCR_AEN_SHIFT)) & CAN_MCR_AEN_MASK)

#define CAN_MCR_LPRIOEN_MASK                 (0x2000U)
#define CAN_MCR_LPRIOEN_SHIFT                (13U)
#define CAN_MCR_LPRIOEN_WIDTH                (1U)
#define CAN_MCR_LPRIOEN(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_MCR_LPRIOEN_SHIFT)) & CAN_MCR_LPRIOEN_MASK)

#define CAN_MCR_PNET_EN_MASK                 (0x4000U)
#define CAN_MCR_PNET_EN_SHIFT                (14U)
#define CAN_MCR_PNET_EN_WIDTH                (1U)
#define CAN_MCR_PNET_EN(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_MCR_PNET_EN_SHIFT)) & CAN_MCR_PNET_EN_MASK)

#define CAN_MCR_DMA_MASK                     (0x8000U)
#define CAN_MCR_DMA_SHIFT                    (15U)
#define CAN_MCR_DMA_WIDTH                    (1U)
#define CAN_MCR_DMA(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_MCR_DMA_SHIFT)) & CAN_MCR_DMA_MASK)

#define CAN_MCR_IRMQ_MASK                    (0x10000U)
#define CAN_MCR_IRMQ_SHIFT                   (16U)
#define CAN_MCR_IRMQ_WIDTH                   (1U)
#define CAN_MCR_IRMQ(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_MCR_IRMQ_SHIFT)) & CAN_MCR_IRMQ_MASK)

#define CAN_MCR_SRXDIS_MASK                  (0x20000U)
#define CAN_MCR_SRXDIS_SHIFT                 (17U)
#define CAN_MCR_SRXDIS_WIDTH                 (1U)
#define CAN_MCR_SRXDIS(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_MCR_SRXDIS_SHIFT)) & CAN_MCR_SRXDIS_MASK)

#define CAN_MCR_LPMACK_MASK                  (0x100000U)
#define CAN_MCR_LPMACK_SHIFT                 (20U)
#define CAN_MCR_LPMACK_WIDTH                 (1U)
#define CAN_MCR_LPMACK(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_MCR_LPMACK_SHIFT)) & CAN_MCR_LPMACK_MASK)

#define CAN_MCR_WRNEN_MASK                   (0x200000U)
#define CAN_MCR_WRNEN_SHIFT                  (21U)
#define CAN_MCR_WRNEN_WIDTH                  (1U)
#define CAN_MCR_WRNEN(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_MCR_WRNEN_SHIFT)) & CAN_MCR_WRNEN_MASK)

#define CAN_MCR_SUPV_MASK                    (0x800000U)
#define CAN_MCR_SUPV_SHIFT                   (23U)
#define CAN_MCR_SUPV_WIDTH                   (1U)
#define CAN_MCR_SUPV(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_MCR_SUPV_SHIFT)) & CAN_MCR_SUPV_MASK)

#define CAN_MCR_FRZACK_MASK                  (0x1000000U)
#define CAN_MCR_FRZACK_SHIFT                 (24U)
#define CAN_MCR_FRZACK_WIDTH                 (1U)
#define CAN_MCR_FRZACK(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_MCR_FRZACK_SHIFT)) & CAN_MCR_FRZACK_MASK)

#define CAN_MCR_SOFTRST_MASK                 (0x2000000U)
#define CAN_MCR_SOFTRST_SHIFT                (25U)
#define CAN_MCR_SOFTRST_WIDTH                (1U)
#define CAN_MCR_SOFTRST(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_MCR_SOFTRST_SHIFT)) & CAN_MCR_SOFTRST_MASK)

#define CAN_MCR_NOTRDY_MASK                  (0x8000000U)
#define CAN_MCR_NOTRDY_SHIFT                 (27U)
#define CAN_MCR_NOTRDY_WIDTH                 (1U)
#define CAN_MCR_NOTRDY(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_MCR_NOTRDY_SHIFT)) & CAN_MCR_NOTRDY_MASK)

#define CAN_MCR_HALT_MASK                    (0x10000000U)
#define CAN_MCR_HALT_SHIFT                   (28U)
#define CAN_MCR_HALT_WIDTH                   (1U)
#define CAN_MCR_HALT(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_MCR_HALT_SHIFT)) & CAN_MCR_HALT_MASK)

#define CAN_MCR_RFEN_MASK                    (0x20000000U)
#define CAN_MCR_RFEN_SHIFT                   (29U)
#define CAN_MCR_RFEN_WIDTH                   (1U)
#define CAN_MCR_RFEN(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_MCR_RFEN_SHIFT)) & CAN_MCR_RFEN_MASK)

#define CAN_MCR_FRZ_MASK                     (0x40000000U)
#define CAN_MCR_FRZ_SHIFT                    (30U)
#define CAN_MCR_FRZ_WIDTH                    (1U)
#define CAN_MCR_FRZ(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_MCR_FRZ_SHIFT)) & CAN_MCR_FRZ_MASK)

