HoangPhuc02/S32K144_CAN_Project/lib/driver/can/can_reg.h
#define CAN_MCR_MDIS_MASK                    (0x80000000U)
#define CAN_MCR_MDIS_SHIFT                   (31U)
#define CAN_MCR_MDIS_WIDTH                   (1U)
#define CAN_MCR_MDIS(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_MCR_MDIS_SHIFT)) & CAN_MCR_MDIS_MASK)
/*! @} */

/*! @name CTRL1 - Control 1 Register */
/*! @{ */

#define CAN_CTRL1_PROPSEG_MASK               (0x7U)
#define CAN_CTRL1_PROPSEG_SHIFT              (0U)
#define CAN_CTRL1_PROPSEG_WIDTH              (3U)
#define CAN_CTRL1_PROPSEG(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PROPSEG_SHIFT)) & CAN_CTRL1_PROPSEG_MASK)

#define CAN_CTRL1_LOM_MASK                   (0x8U)
#define CAN_CTRL1_LOM_SHIFT                  (3U)
#define CAN_CTRL1_LOM_WIDTH                  (1U)
#define CAN_CTRL1_LOM(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_LOM_SHIFT)) & CAN_CTRL1_LOM_MASK)

#define CAN_CTRL1_LBUF_MASK                  (0x10U)
#define CAN_CTRL1_LBUF_SHIFT                 (4U)
#define CAN_CTRL1_LBUF_WIDTH                 (1U)
#define CAN_CTRL1_LBUF(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_LBUF_SHIFT)) & CAN_CTRL1_LBUF_MASK)

#define CAN_CTRL1_TSYN_MASK                  (0x20U)
#define CAN_CTRL1_TSYN_SHIFT                 (5U)
#define CAN_CTRL1_TSYN_WIDTH                 (1U)
#define CAN_CTRL1_TSYN(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_TSYN_SHIFT)) & CAN_CTRL1_TSYN_MASK)

#define CAN_CTRL1_BOFFREC_MASK               (0x40U)
#define CAN_CTRL1_BOFFREC_SHIFT              (6U)
#define CAN_CTRL1_BOFFREC_WIDTH              (1U)
#define CAN_CTRL1_BOFFREC(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_BOFFREC_SHIFT)) & CAN_CTRL1_BOFFREC_MASK)

#define CAN_CTRL1_SMP_MASK                   (0x80U)
#define CAN_CTRL1_SMP_SHIFT                  (7U)
#define CAN_CTRL1_SMP_WIDTH                  (1U)
#define CAN_CTRL1_SMP(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_SMP_SHIFT)) & CAN_CTRL1_SMP_MASK)

#define CAN_CTRL1_RWRNMSK_MASK               (0x400U)
#define CAN_CTRL1_RWRNMSK_SHIFT              (10U)
#define CAN_CTRL1_RWRNMSK_WIDTH              (1U)
#define CAN_CTRL1_RWRNMSK(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_RWRNMSK_SHIFT)) & CAN_CTRL1_RWRNMSK_MASK)

#define CAN_CTRL1_TWRNMSK_MASK               (0x800U)
#define CAN_CTRL1_TWRNMSK_SHIFT              (11U)
#define CAN_CTRL1_TWRNMSK_WIDTH              (1U)
#define CAN_CTRL1_TWRNMSK(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_TWRNMSK_SHIFT)) & CAN_CTRL1_TWRNMSK_MASK)

#define CAN_CTRL1_LPB_MASK                   (0x1000U)
#define CAN_CTRL1_LPB_SHIFT                  (12U)
#define CAN_CTRL1_LPB_WIDTH                  (1U)
#define CAN_CTRL1_LPB(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_LPB_SHIFT)) & CAN_CTRL1_LPB_MASK)

#define CAN_CTRL1_CLKSRC_MASK                (0x2000U)
#define CAN_CTRL1_CLKSRC_SHIFT               (13U)
#define CAN_CTRL1_CLKSRC_WIDTH               (1U)
#define CAN_CTRL1_CLKSRC(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_CLKSRC_SHIFT)) & CAN_CTRL1_CLKSRC_MASK)

#define CAN_CTRL1_ERRMSK_MASK                (0x4000U)
#define CAN_CTRL1_ERRMSK_SHIFT               (14U)
#define CAN_CTRL1_ERRMSK_WIDTH               (1U)
#define CAN_CTRL1_ERRMSK(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_ERRMSK_SHIFT)) & CAN_CTRL1_ERRMSK_MASK)

#define CAN_CTRL1_BOFFMSK_MASK               (0x8000U)
#define CAN_CTRL1_BOFFMSK_SHIFT              (15U)
#define CAN_CTRL1_BOFFMSK_WIDTH              (1U)
#define CAN_CTRL1_BOFFMSK(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_BOFFMSK_SHIFT)) & CAN_CTRL1_BOFFMSK_MASK)

#define CAN_CTRL1_PSEG2_MASK                 (0x70000U)
#define CAN_CTRL1_PSEG2_SHIFT                (16U)
#define CAN_CTRL1_PSEG2_WIDTH                (3U)
#define CAN_CTRL1_PSEG2(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PSEG2_SHIFT)) & CAN_CTRL1_PSEG2_MASK)

#define CAN_CTRL1_PSEG1_MASK                 (0x380000U)
#define CAN_CTRL1_PSEG1_SHIFT                (19U)
#define CAN_CTRL1_PSEG1_WIDTH                (3U)
#define CAN_CTRL1_PSEG1(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PSEG1_SHIFT)) & CAN_CTRL1_PSEG1_MASK)

#define CAN_CTRL1_RJW_MASK                   (0xC00000U)
#define CAN_CTRL1_RJW_SHIFT                  (22U)
#define CAN_CTRL1_RJW_WIDTH                  (2U)
#define CAN_CTRL1_RJW(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_RJW_SHIFT)) & CAN_CTRL1_RJW_MASK)

#define CAN_CTRL1_PRESDIV_MASK               (0xFF000000U)
#define CAN_CTRL1_PRESDIV_SHIFT              (24U)
#define CAN_CTRL1_PRESDIV_WIDTH              (8U)
#define CAN_CTRL1_PRESDIV(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PRESDIV_SHIFT)) & CAN_CTRL1_PRESDIV_MASK)
/*! @} */

/*! @name TIMER - Free Running Timer */
/*! @{ */

#define CAN_TIMER_TIMER_MASK                 (0xFFFFU)
#define CAN_TIMER_TIMER_SHIFT                (0U)
#define CAN_TIMER_TIMER_WIDTH                (16U)
#define CAN_TIMER_TIMER(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_TIMER_TIMER_SHIFT)) & CAN_TIMER_TIMER_MASK)
/*! @} */

/*! @name RXMGMASK - Rx Mailboxes Global Mask Register */
/*! @{ */

#define CAN_RXMGMASK_MG_MASK                 (0xFFFFFFFFU)
#define CAN_RXMGMASK_MG_SHIFT                (0U)
#define CAN_RXMGMASK_MG_WIDTH                (32U)
#define CAN_RXMGMASK_MG(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_RXMGMASK_MG_SHIFT)) & CAN_RXMGMASK_MG_MASK)
/*! @} */

/*! @name RX14MASK - Rx 14 Mask Register */
/*! @{ */

#define CAN_RX14MASK_RX14M_MASK              (0xFFFFFFFFU)
#define CAN_RX14MASK_RX14M_SHIFT             (0U)
#define CAN_RX14MASK_RX14M_WIDTH             (32U)
#define CAN_RX14MASK_RX14M(x)                (((uint32_t)(((uint32_t)(x)) << CAN_RX14MASK_RX14M_SHIFT)) & CAN_RX14MASK_RX14M_MASK)
/*! @} */

/*! @name RX15MASK - Rx 15 Mask Register */
/*! @{ */

#define CAN_RX15MASK_RX15M_MASK              (0xFFFFFFFFU)
#define CAN_RX15MASK_RX15M_SHIFT             (0U)
#define CAN_RX15MASK_RX15M_WIDTH             (32U)
#define CAN_RX15MASK_RX15M(x)                (((uint32_t)(((uint32_t)(x)) << CAN_RX15MASK_RX15M_SHIFT)) & CAN_RX15MASK_RX15M_MASK)
/*! @} */

/*! @name ECR - Error Counter */
/*! @{ */

#define CAN_ECR_TXERRCNT_MASK                (0xFFU)
#define CAN_ECR_TXERRCNT_SHIFT               (0U)
#define CAN_ECR_TXERRCNT_WIDTH               (8U)
#define CAN_ECR_TXERRCNT(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_ECR_TXERRCNT_SHIFT)) & CAN_ECR_TXERRCNT_MASK)

#define CAN_ECR_RXERRCNT_MASK                (0xFF00U)
#define CAN_ECR_RXERRCNT_SHIFT               (8U)
#define CAN_ECR_RXERRCNT_WIDTH               (8U)
#define CAN_ECR_RXERRCNT(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_ECR_RXERRCNT_SHIFT)) & CAN_ECR_RXERRCNT_MASK)

