HoangPhuc02/S32K144_CAN_Project/lib/driver/can/can_reg.h
#define CAN_ESR1_ERROVR_MASK                 (0x200000U)
#define CAN_ESR1_ERROVR_SHIFT                (21U)
#define CAN_ESR1_ERROVR_WIDTH                (1U)
#define CAN_ESR1_ERROVR(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_ERROVR_SHIFT)) & CAN_ESR1_ERROVR_MASK)

#define CAN_ESR1_STFERR_FAST_MASK            (0x4000000U)
#define CAN_ESR1_STFERR_FAST_SHIFT           (26U)
#define CAN_ESR1_STFERR_FAST_WIDTH           (1U)
#define CAN_ESR1_STFERR_FAST(x)              (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_STFERR_FAST_SHIFT)) & CAN_ESR1_STFERR_FAST_MASK)

#define CAN_ESR1_FRMERR_FAST_MASK            (0x8000000U)
#define CAN_ESR1_FRMERR_FAST_SHIFT           (27U)
#define CAN_ESR1_FRMERR_FAST_WIDTH           (1U)
#define CAN_ESR1_FRMERR_FAST(x)              (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_FRMERR_FAST_SHIFT)) & CAN_ESR1_FRMERR_FAST_MASK)

#define CAN_ESR1_CRCERR_FAST_MASK            (0x10000000U)
#define CAN_ESR1_CRCERR_FAST_SHIFT           (28U)
#define CAN_ESR1_CRCERR_FAST_WIDTH           (1U)
#define CAN_ESR1_CRCERR_FAST(x)              (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_CRCERR_FAST_SHIFT)) & CAN_ESR1_CRCERR_FAST_MASK)

#define CAN_ESR1_BIT0ERR_FAST_MASK           (0x40000000U)
#define CAN_ESR1_BIT0ERR_FAST_SHIFT          (30U)
#define CAN_ESR1_BIT0ERR_FAST_WIDTH          (1U)
#define CAN_ESR1_BIT0ERR_FAST(x)             (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_BIT0ERR_FAST_SHIFT)) & CAN_ESR1_BIT0ERR_FAST_MASK)

#define CAN_ESR1_BIT1ERR_FAST_MASK           (0x80000000U)
#define CAN_ESR1_BIT1ERR_FAST_SHIFT          (31U)
#define CAN_ESR1_BIT1ERR_FAST_WIDTH          (1U)
#define CAN_ESR1_BIT1ERR_FAST(x)             (((uint32_t)(((uint32_t)(x)) << CAN_ESR1_BIT1ERR_FAST_SHIFT)) & CAN_ESR1_BIT1ERR_FAST_MASK)
/*! @} */

/*! @name IMASK1 - Interrupt Masks 1 Register */
/*! @{ */

#define CAN_IMASK1_BUF15TO0M_MASK            (0xFFFFU)
#define CAN_IMASK1_BUF15TO0M_SHIFT           (0U)
#define CAN_IMASK1_BUF15TO0M_WIDTH           (16U)
#define CAN_IMASK1_BUF15TO0M(x)              (((uint32_t)(((uint32_t)(x)) << CAN_IMASK1_BUF15TO0M_SHIFT)) & CAN_IMASK1_BUF15TO0M_MASK)

#define CAN_IMASK1_BUF31TO0M_MASK            (0xFFFFFFFFU)
#define CAN_IMASK1_BUF31TO0M_SHIFT           (0U)
#define CAN_IMASK1_BUF31TO0M_WIDTH           (32U)
#define CAN_IMASK1_BUF31TO0M(x)              (((uint32_t)(((uint32_t)(x)) << CAN_IMASK1_BUF31TO0M_SHIFT)) & CAN_IMASK1_BUF31TO0M_MASK)
/*! @} */

/*! @name IFLAG1 - Interrupt Flags 1 Register */
/*! @{ */

#define CAN_IFLAG1_BUF0I_MASK                (0x1U)
#define CAN_IFLAG1_BUF0I_SHIFT               (0U)
#define CAN_IFLAG1_BUF0I_WIDTH               (1U)
#define CAN_IFLAG1_BUF0I(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_IFLAG1_BUF0I_SHIFT)) & CAN_IFLAG1_BUF0I_MASK)

#define CAN_IFLAG1_BUF4TO1I_MASK             (0x1EU)
#define CAN_IFLAG1_BUF4TO1I_SHIFT            (1U)
#define CAN_IFLAG1_BUF4TO1I_WIDTH            (4U)
#define CAN_IFLAG1_BUF4TO1I(x)               (((uint32_t)(((uint32_t)(x)) << CAN_IFLAG1_BUF4TO1I_SHIFT)) & CAN_IFLAG1_BUF4TO1I_MASK)

#define CAN_IFLAG1_BUF5I_MASK                (0x20U)
#define CAN_IFLAG1_BUF5I_SHIFT               (5U)
#define CAN_IFLAG1_BUF5I_WIDTH               (1U)
#define CAN_IFLAG1_BUF5I(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_IFLAG1_BUF5I_SHIFT)) & CAN_IFLAG1_BUF5I_MASK)

#define CAN_IFLAG1_BUF6I_MASK                (0x40U)
#define CAN_IFLAG1_BUF6I_SHIFT               (6U)
#define CAN_IFLAG1_BUF6I_WIDTH               (1U)
#define CAN_IFLAG1_BUF6I(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_IFLAG1_BUF6I_SHIFT)) & CAN_IFLAG1_BUF6I_MASK)

#define CAN_IFLAG1_BUF7I_MASK                (0x80U)
#define CAN_IFLAG1_BUF7I_SHIFT               (7U)
#define CAN_IFLAG1_BUF7I_WIDTH               (1U)
#define CAN_IFLAG1_BUF7I(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_IFLAG1_BUF7I_SHIFT)) & CAN_IFLAG1_BUF7I_MASK)

#define CAN_IFLAG1_BUF15TO8I_MASK            (0xFF00U)
#define CAN_IFLAG1_BUF15TO8I_SHIFT           (8U)
#define CAN_IFLAG1_BUF15TO8I_WIDTH           (8U)
#define CAN_IFLAG1_BUF15TO8I(x)              (((uint32_t)(((uint32_t)(x)) << CAN_IFLAG1_BUF15TO8I_SHIFT)) & CAN_IFLAG1_BUF15TO8I_MASK)

#define CAN_IFLAG1_BUF31TO8I_MASK            (0xFFFFFF00U)
#define CAN_IFLAG1_BUF31TO8I_SHIFT           (8U)
#define CAN_IFLAG1_BUF31TO8I_WIDTH           (24U)
#define CAN_IFLAG1_BUF31TO8I(x)              (((uint32_t)(((uint32_t)(x)) << CAN_IFLAG1_BUF31TO8I_SHIFT)) & CAN_IFLAG1_BUF31TO8I_MASK)
/*! @} */

/*! @name CTRL2 - Control 2 Register */
/*! @{ */

#define CAN_CTRL2_EDFLTDIS_MASK              (0x800U)
#define CAN_CTRL2_EDFLTDIS_SHIFT             (11U)
#define CAN_CTRL2_EDFLTDIS_WIDTH             (1U)
#define CAN_CTRL2_EDFLTDIS(x)                (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_EDFLTDIS_SHIFT)) & CAN_CTRL2_EDFLTDIS_MASK)

#define CAN_CTRL2_ISOCANFDEN_MASK            (0x1000U)
#define CAN_CTRL2_ISOCANFDEN_SHIFT           (12U)
#define CAN_CTRL2_ISOCANFDEN_WIDTH           (1U)
#define CAN_CTRL2_ISOCANFDEN(x)              (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_ISOCANFDEN_SHIFT)) & CAN_CTRL2_ISOCANFDEN_MASK)

#define CAN_CTRL2_PREXCEN_MASK               (0x4000U)
#define CAN_CTRL2_PREXCEN_SHIFT              (14U)
#define CAN_CTRL2_PREXCEN_WIDTH              (1U)
#define CAN_CTRL2_PREXCEN(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_PREXCEN_SHIFT)) & CAN_CTRL2_PREXCEN_MASK)

#define CAN_CTRL2_TIMER_SRC_MASK             (0x8000U)
#define CAN_CTRL2_TIMER_SRC_SHIFT            (15U)
#define CAN_CTRL2_TIMER_SRC_WIDTH            (1U)
#define CAN_CTRL2_TIMER_SRC(x)               (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_TIMER_SRC_SHIFT)) & CAN_CTRL2_TIMER_SRC_MASK)

#define CAN_CTRL2_EACEN_MASK                 (0x10000U)
#define CAN_CTRL2_EACEN_SHIFT                (16U)
#define CAN_CTRL2_EACEN_WIDTH                (1U)
#define CAN_CTRL2_EACEN(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_EACEN_SHIFT)) & CAN_CTRL2_EACEN_MASK)

#define CAN_CTRL2_RRS_MASK                   (0x20000U)
#define CAN_CTRL2_RRS_SHIFT                  (17U)
#define CAN_CTRL2_RRS_WIDTH                  (1U)
#define CAN_CTRL2_RRS(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_RRS_SHIFT)) & CAN_CTRL2_RRS_MASK)

