HoangPhuc02/S32K144_CAN_Project/lib/driver/can/can_reg.h
#define CAN_CTRL2_MRP_MASK                   (0x40000U)
#define CAN_CTRL2_MRP_SHIFT                  (18U)
#define CAN_CTRL2_MRP_WIDTH                  (1U)
#define CAN_CTRL2_MRP(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_MRP_SHIFT)) & CAN_CTRL2_MRP_MASK)

#define CAN_CTRL2_TASD_MASK                  (0xF80000U)
#define CAN_CTRL2_TASD_SHIFT                 (19U)
#define CAN_CTRL2_TASD_WIDTH                 (5U)
#define CAN_CTRL2_TASD(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_TASD_SHIFT)) & CAN_CTRL2_TASD_MASK)

#define CAN_CTRL2_RFFN_MASK                  (0xF000000U)
#define CAN_CTRL2_RFFN_SHIFT                 (24U)
#define CAN_CTRL2_RFFN_WIDTH                 (4U)
#define CAN_CTRL2_RFFN(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_RFFN_SHIFT)) & CAN_CTRL2_RFFN_MASK)

#define CAN_CTRL2_BOFFDONEMSK_MASK           (0x40000000U)
#define CAN_CTRL2_BOFFDONEMSK_SHIFT          (30U)
#define CAN_CTRL2_BOFFDONEMSK_WIDTH          (1U)
#define CAN_CTRL2_BOFFDONEMSK(x)             (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_BOFFDONEMSK_SHIFT)) & CAN_CTRL2_BOFFDONEMSK_MASK)

#define CAN_CTRL2_ERRMSK_FAST_MASK           (0x80000000U)
#define CAN_CTRL2_ERRMSK_FAST_SHIFT          (31U)
#define CAN_CTRL2_ERRMSK_FAST_WIDTH          (1U)
#define CAN_CTRL2_ERRMSK_FAST(x)             (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_ERRMSK_FAST_SHIFT)) & CAN_CTRL2_ERRMSK_FAST_MASK)
/*! @} */

/*! @name ESR2 - Error and Status 2 Register */
/*! @{ */

#define CAN_ESR2_IMB_MASK                    (0x2000U)
#define CAN_ESR2_IMB_SHIFT                   (13U)
#define CAN_ESR2_IMB_WIDTH                   (1U)
#define CAN_ESR2_IMB(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ESR2_IMB_SHIFT)) & CAN_ESR2_IMB_MASK)

#define CAN_ESR2_VPS_MASK                    (0x4000U)
#define CAN_ESR2_VPS_SHIFT                   (14U)
#define CAN_ESR2_VPS_WIDTH                   (1U)
#define CAN_ESR2_VPS(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_ESR2_VPS_SHIFT)) & CAN_ESR2_VPS_MASK)

#define CAN_ESR2_LPTM_MASK                   (0x7F0000U)
#define CAN_ESR2_LPTM_SHIFT                  (16U)
#define CAN_ESR2_LPTM_WIDTH                  (7U)
#define CAN_ESR2_LPTM(x)                     (((uint32_t)(((uint32_t)(x)) << CAN_ESR2_LPTM_SHIFT)) & CAN_ESR2_LPTM_MASK)
/*! @} */

/*! @name CRCR - CRC Register */
/*! @{ */

#define CAN_CRCR_TXCRC_MASK                  (0x7FFFU)
#define CAN_CRCR_TXCRC_SHIFT                 (0U)
#define CAN_CRCR_TXCRC_WIDTH                 (15U)
#define CAN_CRCR_TXCRC(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_CRCR_TXCRC_SHIFT)) & CAN_CRCR_TXCRC_MASK)

#define CAN_CRCR_MBCRC_MASK                  (0x7F0000U)
#define CAN_CRCR_MBCRC_SHIFT                 (16U)
#define CAN_CRCR_MBCRC_WIDTH                 (7U)
#define CAN_CRCR_MBCRC(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_CRCR_MBCRC_SHIFT)) & CAN_CRCR_MBCRC_MASK)
/*! @} */

/*! @name RXFGMASK - Rx FIFO Global Mask Register */
/*! @{ */

#define CAN_RXFGMASK_FGM_MASK                (0xFFFFFFFFU)
#define CAN_RXFGMASK_FGM_SHIFT               (0U)
#define CAN_RXFGMASK_FGM_WIDTH               (32U)
#define CAN_RXFGMASK_FGM(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_RXFGMASK_FGM_SHIFT)) & CAN_RXFGMASK_FGM_MASK)
/*! @} */

/*! @name RXFIR - Rx FIFO Information Register */
/*! @{ */

#define CAN_RXFIR_IDHIT_MASK                 (0x1FFU)
#define CAN_RXFIR_IDHIT_SHIFT                (0U)
#define CAN_RXFIR_IDHIT_WIDTH                (9U)
#define CAN_RXFIR_IDHIT(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_RXFIR_IDHIT_SHIFT)) & CAN_RXFIR_IDHIT_MASK)
/*! @} */

/*! @name CBT - CAN Bit Timing Register */
/*! @{ */

#define CAN_CBT_EPSEG2_MASK                  (0x1FU)
#define CAN_CBT_EPSEG2_SHIFT                 (0U)
#define CAN_CBT_EPSEG2_WIDTH                 (5U)
#define CAN_CBT_EPSEG2(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_CBT_EPSEG2_SHIFT)) & CAN_CBT_EPSEG2_MASK)

#define CAN_CBT_EPSEG1_MASK                  (0x3E0U)
#define CAN_CBT_EPSEG1_SHIFT                 (5U)
#define CAN_CBT_EPSEG1_WIDTH                 (5U)
#define CAN_CBT_EPSEG1(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_CBT_EPSEG1_SHIFT)) & CAN_CBT_EPSEG1_MASK)

#define CAN_CBT_EPROPSEG_MASK                (0xFC00U)
#define CAN_CBT_EPROPSEG_SHIFT               (10U)
#define CAN_CBT_EPROPSEG_WIDTH               (6U)
#define CAN_CBT_EPROPSEG(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_CBT_EPROPSEG_SHIFT)) & CAN_CBT_EPROPSEG_MASK)

#define CAN_CBT_ERJW_MASK                    (0x1F0000U)  /* Merged from fields with different position or width, of widths (4, 5), largest definition used */
#define CAN_CBT_ERJW_SHIFT                   (16U)
#define CAN_CBT_ERJW_WIDTH                   (5U)
#define CAN_CBT_ERJW(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_CBT_ERJW_SHIFT)) & CAN_CBT_ERJW_MASK)  /* Merged from fields with different position or width, of widths (4, 5), largest definition used */

#define CAN_CBT_EPRESDIV_MASK                (0x7FE00000U)
#define CAN_CBT_EPRESDIV_SHIFT               (21U)
#define CAN_CBT_EPRESDIV_WIDTH               (10U)
#define CAN_CBT_EPRESDIV(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_CBT_EPRESDIV_SHIFT)) & CAN_CBT_EPRESDIV_MASK)

#define CAN_CBT_BTF_MASK                     (0x80000000U)
#define CAN_CBT_BTF_SHIFT                    (31U)
#define CAN_CBT_BTF_WIDTH                    (1U)
#define CAN_CBT_BTF(x)                       (((uint32_t)(((uint32_t)(x)) << CAN_CBT_BTF_SHIFT)) & CAN_CBT_BTF_MASK)
/*! @} */

/*! @name RAMn - Embedded RAM */
/*! @{ */

#define CAN_RAMn_DATA_BYTE_3_MASK            (0xFFU)
#define CAN_RAMn_DATA_BYTE_3_SHIFT           (0U)
#define CAN_RAMn_DATA_BYTE_3_WIDTH           (8U)
#define CAN_RAMn_DATA_BYTE_3(x)              (((uint32_t)(((uint32_t)(x)) << CAN_RAMn_DATA_BYTE_3_SHIFT)) & CAN_RAMn_DATA_BYTE_3_MASK)

#define CAN_RAMn_DATA_BYTE_2_MASK            (0xFF00U)
#define CAN_RAMn_DATA_BYTE_2_SHIFT           (8U)
#define CAN_RAMn_DATA_BYTE_2_WIDTH           (8U)
#define CAN_RAMn_DATA_BYTE_2(x)              (((uint32_t)(((uint32_t)(x)) << CAN_RAMn_DATA_BYTE_2_SHIFT)) & CAN_RAMn_DATA_BYTE_2_MASK)

