HoangPhuc02/S32K144_CAN_Project/lib/driver/can/can_reg.h
#define CAN_RAMn_DATA_BYTE_1_MASK            (0xFF0000U)
#define CAN_RAMn_DATA_BYTE_1_SHIFT           (16U)
#define CAN_RAMn_DATA_BYTE_1_WIDTH           (8U)
#define CAN_RAMn_DATA_BYTE_1(x)              (((uint32_t)(((uint32_t)(x)) << CAN_RAMn_DATA_BYTE_1_SHIFT)) & CAN_RAMn_DATA_BYTE_1_MASK)

#define CAN_RAMn_DATA_BYTE_0_MASK            (0xFF000000U)
#define CAN_RAMn_DATA_BYTE_0_SHIFT           (24U)
#define CAN_RAMn_DATA_BYTE_0_WIDTH           (8U)
#define CAN_RAMn_DATA_BYTE_0(x)              (((uint32_t)(((uint32_t)(x)) << CAN_RAMn_DATA_BYTE_0_SHIFT)) & CAN_RAMn_DATA_BYTE_0_MASK)
/*! @} */

/*! @name RXIMR - Rx Individual Mask Registers */
/*! @{ */

#define CAN_RXIMR_MI_MASK                    (0xFFFFFFFFU)
#define CAN_RXIMR_MI_SHIFT                   (0U)
#define CAN_RXIMR_MI_WIDTH                   (32U)
#define CAN_RXIMR_MI(x)                      (((uint32_t)(((uint32_t)(x)) << CAN_RXIMR_MI_SHIFT)) & CAN_RXIMR_MI_MASK)
/*! @} */

/*! @name CTRL1_PN - Pretended Networking Control 1 Register */
/*! @{ */

#define CAN_CTRL1_PN_FCS_MASK                (0x3U)
#define CAN_CTRL1_PN_FCS_SHIFT               (0U)
#define CAN_CTRL1_PN_FCS_WIDTH               (2U)
#define CAN_CTRL1_PN_FCS(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_FCS_SHIFT)) & CAN_CTRL1_PN_FCS_MASK)

#define CAN_CTRL1_PN_IDFS_MASK               (0xCU)
#define CAN_CTRL1_PN_IDFS_SHIFT              (2U)
#define CAN_CTRL1_PN_IDFS_WIDTH              (2U)
#define CAN_CTRL1_PN_IDFS(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_IDFS_SHIFT)) & CAN_CTRL1_PN_IDFS_MASK)

#define CAN_CTRL1_PN_PLFS_MASK               (0x30U)
#define CAN_CTRL1_PN_PLFS_SHIFT              (4U)
#define CAN_CTRL1_PN_PLFS_WIDTH              (2U)
#define CAN_CTRL1_PN_PLFS(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_PLFS_SHIFT)) & CAN_CTRL1_PN_PLFS_MASK)

#define CAN_CTRL1_PN_NMATCH_MASK             (0xFF00U)
#define CAN_CTRL1_PN_NMATCH_SHIFT            (8U)
#define CAN_CTRL1_PN_NMATCH_WIDTH            (8U)
#define CAN_CTRL1_PN_NMATCH(x)               (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_NMATCH_SHIFT)) & CAN_CTRL1_PN_NMATCH_MASK)

#define CAN_CTRL1_PN_WUMF_MSK_MASK           (0x10000U)
#define CAN_CTRL1_PN_WUMF_MSK_SHIFT          (16U)
#define CAN_CTRL1_PN_WUMF_MSK_WIDTH          (1U)
#define CAN_CTRL1_PN_WUMF_MSK(x)             (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_WUMF_MSK_SHIFT)) & CAN_CTRL1_PN_WUMF_MSK_MASK)

#define CAN_CTRL1_PN_WTOF_MSK_MASK           (0x20000U)
#define CAN_CTRL1_PN_WTOF_MSK_SHIFT          (17U)
#define CAN_CTRL1_PN_WTOF_MSK_WIDTH          (1U)
#define CAN_CTRL1_PN_WTOF_MSK(x)             (((uint32_t)(((uint32_t)(x)) << CAN_CTRL1_PN_WTOF_MSK_SHIFT)) & CAN_CTRL1_PN_WTOF_MSK_MASK)
/*! @} */

/*! @name CTRL2_PN - Pretended Networking Control 2 Register */
/*! @{ */

#define CAN_CTRL2_PN_MATCHTO_MASK            (0xFFFFU)
#define CAN_CTRL2_PN_MATCHTO_SHIFT           (0U)
#define CAN_CTRL2_PN_MATCHTO_WIDTH           (16U)
#define CAN_CTRL2_PN_MATCHTO(x)              (((uint32_t)(((uint32_t)(x)) << CAN_CTRL2_PN_MATCHTO_SHIFT)) & CAN_CTRL2_PN_MATCHTO_MASK)
/*! @} */

/*! @name WU_MTC - Pretended Networking Wake Up Match Register */
/*! @{ */

#define CAN_WU_MTC_MCOUNTER_MASK             (0xFF00U)
#define CAN_WU_MTC_MCOUNTER_SHIFT            (8U)
#define CAN_WU_MTC_MCOUNTER_WIDTH            (8U)
#define CAN_WU_MTC_MCOUNTER(x)               (((uint32_t)(((uint32_t)(x)) << CAN_WU_MTC_MCOUNTER_SHIFT)) & CAN_WU_MTC_MCOUNTER_MASK)

#define CAN_WU_MTC_WUMF_MASK                 (0x10000U)
#define CAN_WU_MTC_WUMF_SHIFT                (16U)
#define CAN_WU_MTC_WUMF_WIDTH                (1U)
#define CAN_WU_MTC_WUMF(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_WU_MTC_WUMF_SHIFT)) & CAN_WU_MTC_WUMF_MASK)

#define CAN_WU_MTC_WTOF_MASK                 (0x20000U)
#define CAN_WU_MTC_WTOF_SHIFT                (17U)
#define CAN_WU_MTC_WTOF_WIDTH                (1U)
#define CAN_WU_MTC_WTOF(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_WU_MTC_WTOF_SHIFT)) & CAN_WU_MTC_WTOF_MASK)
/*! @} */

/*! @name FLT_ID1 - Pretended Networking ID Filter 1 Register */
/*! @{ */

#define CAN_FLT_ID1_FLT_ID1_MASK             (0x1FFFFFFFU)
#define CAN_FLT_ID1_FLT_ID1_SHIFT            (0U)
#define CAN_FLT_ID1_FLT_ID1_WIDTH            (29U)
#define CAN_FLT_ID1_FLT_ID1(x)               (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID1_FLT_ID1_SHIFT)) & CAN_FLT_ID1_FLT_ID1_MASK)

#define CAN_FLT_ID1_FLT_RTR_MASK             (0x20000000U)
#define CAN_FLT_ID1_FLT_RTR_SHIFT            (29U)
#define CAN_FLT_ID1_FLT_RTR_WIDTH            (1U)
#define CAN_FLT_ID1_FLT_RTR(x)               (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID1_FLT_RTR_SHIFT)) & CAN_FLT_ID1_FLT_RTR_MASK)

#define CAN_FLT_ID1_FLT_IDE_MASK             (0x40000000U)
#define CAN_FLT_ID1_FLT_IDE_SHIFT            (30U)
#define CAN_FLT_ID1_FLT_IDE_WIDTH            (1U)
#define CAN_FLT_ID1_FLT_IDE(x)               (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID1_FLT_IDE_SHIFT)) & CAN_FLT_ID1_FLT_IDE_MASK)
/*! @} */

/*! @name FLT_DLC - Pretended Networking DLC Filter Register */
/*! @{ */

#define CAN_FLT_DLC_FLT_DLC_HI_MASK          (0xFU)
#define CAN_FLT_DLC_FLT_DLC_HI_SHIFT         (0U)
#define CAN_FLT_DLC_FLT_DLC_HI_WIDTH         (4U)
#define CAN_FLT_DLC_FLT_DLC_HI(x)            (((uint32_t)(((uint32_t)(x)) << CAN_FLT_DLC_FLT_DLC_HI_SHIFT)) & CAN_FLT_DLC_FLT_DLC_HI_MASK)

#define CAN_FLT_DLC_FLT_DLC_LO_MASK          (0xF0000U)
#define CAN_FLT_DLC_FLT_DLC_LO_SHIFT         (16U)
#define CAN_FLT_DLC_FLT_DLC_LO_WIDTH         (4U)
#define CAN_FLT_DLC_FLT_DLC_LO(x)            (((uint32_t)(((uint32_t)(x)) << CAN_FLT_DLC_FLT_DLC_LO_SHIFT)) & CAN_FLT_DLC_FLT_DLC_LO_MASK)
/*! @} */

/*! @name PL1_LO - Pretended Networking Payload Low Filter 1 Register */
/*! @{ */

#define CAN_PL1_LO_Data_byte_3_MASK          (0xFFU)
#define CAN_PL1_LO_Data_byte_3_SHIFT         (0U)
#define CAN_PL1_LO_Data_byte_3_WIDTH         (8U)
#define CAN_PL1_LO_Data_byte_3(x)            (((uint32_t)(((uint32_t)(x)) << CAN_PL1_LO_Data_byte_3_SHIFT)) & CAN_PL1_LO_Data_byte_3_MASK)

#define CAN_PL1_LO_Data_byte_2_MASK          (0xFF00U)
#define CAN_PL1_LO_Data_byte_2_SHIFT         (8U)
#define CAN_PL1_LO_Data_byte_2_WIDTH         (8U)
#define CAN_PL1_LO_Data_byte_2(x)            (((uint32_t)(((uint32_t)(x)) << CAN_PL1_LO_Data_byte_2_SHIFT)) & CAN_PL1_LO_Data_byte_2_MASK)

#define CAN_PL1_LO_Data_byte_1_MASK          (0xFF0000U)
#define CAN_PL1_LO_Data_byte_1_SHIFT         (16U)
#define CAN_PL1_LO_Data_byte_1_WIDTH         (8U)
#define CAN_PL1_LO_Data_byte_1(x)            (((uint32_t)(((uint32_t)(x)) << CAN_PL1_LO_Data_byte_1_SHIFT)) & CAN_PL1_LO_Data_byte_1_MASK)

