HoangPhuc02/S32K144_CAN_Project/lib/driver/can/can_reg.h
#define CAN_PL1_LO_Data_byte_0_MASK          (0xFF000000U)
#define CAN_PL1_LO_Data_byte_0_SHIFT         (24U)
#define CAN_PL1_LO_Data_byte_0_WIDTH         (8U)
#define CAN_PL1_LO_Data_byte_0(x)            (((uint32_t)(((uint32_t)(x)) << CAN_PL1_LO_Data_byte_0_SHIFT)) & CAN_PL1_LO_Data_byte_0_MASK)
/*! @} */

/*! @name PL1_HI - Pretended Networking Payload High Filter 1 Register */
/*! @{ */

#define CAN_PL1_HI_Data_byte_7_MASK          (0xFFU)
#define CAN_PL1_HI_Data_byte_7_SHIFT         (0U)
#define CAN_PL1_HI_Data_byte_7_WIDTH         (8U)
#define CAN_PL1_HI_Data_byte_7(x)            (((uint32_t)(((uint32_t)(x)) << CAN_PL1_HI_Data_byte_7_SHIFT)) & CAN_PL1_HI_Data_byte_7_MASK)

#define CAN_PL1_HI_Data_byte_6_MASK          (0xFF00U)
#define CAN_PL1_HI_Data_byte_6_SHIFT         (8U)
#define CAN_PL1_HI_Data_byte_6_WIDTH         (8U)
#define CAN_PL1_HI_Data_byte_6(x)            (((uint32_t)(((uint32_t)(x)) << CAN_PL1_HI_Data_byte_6_SHIFT)) & CAN_PL1_HI_Data_byte_6_MASK)

#define CAN_PL1_HI_Data_byte_5_MASK          (0xFF0000U)
#define CAN_PL1_HI_Data_byte_5_SHIFT         (16U)
#define CAN_PL1_HI_Data_byte_5_WIDTH         (8U)
#define CAN_PL1_HI_Data_byte_5(x)            (((uint32_t)(((uint32_t)(x)) << CAN_PL1_HI_Data_byte_5_SHIFT)) & CAN_PL1_HI_Data_byte_5_MASK)

#define CAN_PL1_HI_Data_byte_4_MASK          (0xFF000000U)
#define CAN_PL1_HI_Data_byte_4_SHIFT         (24U)
#define CAN_PL1_HI_Data_byte_4_WIDTH         (8U)
#define CAN_PL1_HI_Data_byte_4(x)            (((uint32_t)(((uint32_t)(x)) << CAN_PL1_HI_Data_byte_4_SHIFT)) & CAN_PL1_HI_Data_byte_4_MASK)
/*! @} */

/*! @name FLT_ID2_IDMASK - Pretended Networking ID Filter 2 Register / ID Mask Register */
/*! @{ */

#define CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_MASK (0x1FFFFFFFU)
#define CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_SHIFT (0U)
#define CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_WIDTH (29U)
#define CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK(x) (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_SHIFT)) & CAN_FLT_ID2_IDMASK_FLT_ID2_IDMASK_MASK)

#define CAN_FLT_ID2_IDMASK_RTR_MSK_MASK      (0x20000000U)
#define CAN_FLT_ID2_IDMASK_RTR_MSK_SHIFT     (29U)
#define CAN_FLT_ID2_IDMASK_RTR_MSK_WIDTH     (1U)
#define CAN_FLT_ID2_IDMASK_RTR_MSK(x)        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID2_IDMASK_RTR_MSK_SHIFT)) & CAN_FLT_ID2_IDMASK_RTR_MSK_MASK)

#define CAN_FLT_ID2_IDMASK_IDE_MSK_MASK      (0x40000000U)
#define CAN_FLT_ID2_IDMASK_IDE_MSK_SHIFT     (30U)
#define CAN_FLT_ID2_IDMASK_IDE_MSK_WIDTH     (1U)
#define CAN_FLT_ID2_IDMASK_IDE_MSK(x)        (((uint32_t)(((uint32_t)(x)) << CAN_FLT_ID2_IDMASK_IDE_MSK_SHIFT)) & CAN_FLT_ID2_IDMASK_IDE_MSK_MASK)
/*! @} */

/*! @name PL2_PLMASK_LO - Pretended Networking Payload Low Filter 2 Register / Payload Low Mask register */
/*! @{ */

#define CAN_PL2_PLMASK_LO_Data_byte_3_MASK   (0xFFU)
#define CAN_PL2_PLMASK_LO_Data_byte_3_SHIFT  (0U)
#define CAN_PL2_PLMASK_LO_Data_byte_3_WIDTH  (8U)
#define CAN_PL2_PLMASK_LO_Data_byte_3(x)     (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_LO_Data_byte_3_SHIFT)) & CAN_PL2_PLMASK_LO_Data_byte_3_MASK)

#define CAN_PL2_PLMASK_LO_Data_byte_2_MASK   (0xFF00U)
#define CAN_PL2_PLMASK_LO_Data_byte_2_SHIFT  (8U)
#define CAN_PL2_PLMASK_LO_Data_byte_2_WIDTH  (8U)
#define CAN_PL2_PLMASK_LO_Data_byte_2(x)     (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_LO_Data_byte_2_SHIFT)) & CAN_PL2_PLMASK_LO_Data_byte_2_MASK)

#define CAN_PL2_PLMASK_LO_Data_byte_1_MASK   (0xFF0000U)
#define CAN_PL2_PLMASK_LO_Data_byte_1_SHIFT  (16U)
#define CAN_PL2_PLMASK_LO_Data_byte_1_WIDTH  (8U)
#define CAN_PL2_PLMASK_LO_Data_byte_1(x)     (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_LO_Data_byte_1_SHIFT)) & CAN_PL2_PLMASK_LO_Data_byte_1_MASK)

#define CAN_PL2_PLMASK_LO_Data_byte_0_MASK   (0xFF000000U)
#define CAN_PL2_PLMASK_LO_Data_byte_0_SHIFT  (24U)
#define CAN_PL2_PLMASK_LO_Data_byte_0_WIDTH  (8U)
#define CAN_PL2_PLMASK_LO_Data_byte_0(x)     (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_LO_Data_byte_0_SHIFT)) & CAN_PL2_PLMASK_LO_Data_byte_0_MASK)
/*! @} */

/*! @name PL2_PLMASK_HI - Pretended Networking Payload High Filter 2 low order bits / Payload High Mask register */
/*! @{ */

#define CAN_PL2_PLMASK_HI_Data_byte_7_MASK   (0xFFU)
#define CAN_PL2_PLMASK_HI_Data_byte_7_SHIFT  (0U)
#define CAN_PL2_PLMASK_HI_Data_byte_7_WIDTH  (8U)
#define CAN_PL2_PLMASK_HI_Data_byte_7(x)     (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_HI_Data_byte_7_SHIFT)) & CAN_PL2_PLMASK_HI_Data_byte_7_MASK)

#define CAN_PL2_PLMASK_HI_Data_byte_6_MASK   (0xFF00U)
#define CAN_PL2_PLMASK_HI_Data_byte_6_SHIFT  (8U)
#define CAN_PL2_PLMASK_HI_Data_byte_6_WIDTH  (8U)
#define CAN_PL2_PLMASK_HI_Data_byte_6(x)     (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_HI_Data_byte_6_SHIFT)) & CAN_PL2_PLMASK_HI_Data_byte_6_MASK)

#define CAN_PL2_PLMASK_HI_Data_byte_5_MASK   (0xFF0000U)
#define CAN_PL2_PLMASK_HI_Data_byte_5_SHIFT  (16U)
#define CAN_PL2_PLMASK_HI_Data_byte_5_WIDTH  (8U)
#define CAN_PL2_PLMASK_HI_Data_byte_5(x)     (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_HI_Data_byte_5_SHIFT)) & CAN_PL2_PLMASK_HI_Data_byte_5_MASK)

#define CAN_PL2_PLMASK_HI_Data_byte_4_MASK   (0xFF000000U)
#define CAN_PL2_PLMASK_HI_Data_byte_4_SHIFT  (24U)
#define CAN_PL2_PLMASK_HI_Data_byte_4_WIDTH  (8U)
#define CAN_PL2_PLMASK_HI_Data_byte_4(x)     (((uint32_t)(((uint32_t)(x)) << CAN_PL2_PLMASK_HI_Data_byte_4_SHIFT)) & CAN_PL2_PLMASK_HI_Data_byte_4_MASK)
/*! @} */
// TODO add buffer structure
/*! @name WMBn_CS - Wake Up Message Buffer register for C/S */
/*! @{ */
#define CAN_WMBn_CS_CODE_MASK                 (0xF000000U)
#define CAN_WMBn_CS_CODE_SHIFT                (24U)
#define CAN_WMBn_CS_CODE_WIDTH                (4U)
#define CAN_WMBn_CS_CODE(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_CS_CODE_SHIFT)) & CAN_WMBn_CS_CODE_MASK)


#define CAN_WMBn_CS_DLC_MASK                 (0xF0000U)
#define CAN_WMBn_CS_DLC_SHIFT                (16U)
#define CAN_WMBn_CS_DLC_WIDTH                (4U)
#define CAN_WMBn_CS_DLC(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_CS_DLC_SHIFT)) & CAN_WMBn_CS_DLC_MASK)

#define CAN_WMBn_CS_RTR_MASK                 (0x100000U)
#define CAN_WMBn_CS_RTR_SHIFT                (20U)
#define CAN_WMBn_CS_RTR_WIDTH                (1U)
#define CAN_WMBn_CS_RTR(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_CS_RTR_SHIFT)) & CAN_WMBn_CS_RTR_MASK)

#define CAN_WMBn_CS_IDE_MASK                 (0x200000U)
#define CAN_WMBn_CS_IDE_SHIFT                (21U)
#define CAN_WMBn_CS_IDE_WIDTH                (1U)
#define CAN_WMBn_CS_IDE(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_CS_IDE_SHIFT)) & CAN_WMBn_CS_IDE_MASK)

#define CAN_WMBn_CS_SRR_MASK                 (0x400000U)
#define CAN_WMBn_CS_SRR_SHIFT                (22U)
#define CAN_WMBn_CS_SRR_WIDTH                (1U)
#define CAN_WMBn_CS_SRR(x)                   (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_CS_SRR_SHIFT)) & CAN_WMBn_CS_SRR_MASK)
/*! @} */

/*! @name WMBn_ID - Wake Up Message Buffer Register for ID */
/*! @{ */

