HoangPhuc02/S32K144_CAN_Project/lib/driver/can/can_reg.h
#define CAN_WMBn_ID_ID_MASK                  (0x1FFFFFFFU)
#define CAN_WMBn_ID_ID_SHIFT                 (0U)
#define CAN_WMBn_ID_ID_WIDTH                 (29U)
#define CAN_WMBn_ID_ID(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_ID_ID_SHIFT)) & CAN_WMBn_ID_ID_MASK)
/*! @} */

/*! @name WMBn_D03 - Wake Up Message Buffer Register for Data 0-3 */
/*! @{ */

#define CAN_WMBn_D03_Data_byte_3_MASK        (0xFFU)
#define CAN_WMBn_D03_Data_byte_3_SHIFT       (0U)
#define CAN_WMBn_D03_Data_byte_3_WIDTH       (8U)
#define CAN_WMBn_D03_Data_byte_3(x)          (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D03_Data_byte_3_SHIFT)) & CAN_WMBn_D03_Data_byte_3_MASK)

#define CAN_WMBn_D03_Data_byte_2_MASK        (0xFF00U)
#define CAN_WMBn_D03_Data_byte_2_SHIFT       (8U)
#define CAN_WMBn_D03_Data_byte_2_WIDTH       (8U)
#define CAN_WMBn_D03_Data_byte_2(x)          (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D03_Data_byte_2_SHIFT)) & CAN_WMBn_D03_Data_byte_2_MASK)

#define CAN_WMBn_D03_Data_byte_1_MASK        (0xFF0000U)
#define CAN_WMBn_D03_Data_byte_1_SHIFT       (16U)
#define CAN_WMBn_D03_Data_byte_1_WIDTH       (8U)
#define CAN_WMBn_D03_Data_byte_1(x)          (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D03_Data_byte_1_SHIFT)) & CAN_WMBn_D03_Data_byte_1_MASK)

#define CAN_WMBn_D03_Data_byte_0_MASK        (0xFF000000U)
#define CAN_WMBn_D03_Data_byte_0_SHIFT       (24U)
#define CAN_WMBn_D03_Data_byte_0_WIDTH       (8U)
#define CAN_WMBn_D03_Data_byte_0(x)          (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D03_Data_byte_0_SHIFT)) & CAN_WMBn_D03_Data_byte_0_MASK)
/*! @} */

/*! @name WMBn_D47 - Wake Up Message Buffer Register Data 4-7 */
/*! @{ */

#define CAN_WMBn_D47_Data_byte_7_MASK        (0xFFU)
#define CAN_WMBn_D47_Data_byte_7_SHIFT       (0U)
#define CAN_WMBn_D47_Data_byte_7_WIDTH       (8U)
#define CAN_WMBn_D47_Data_byte_7(x)          (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D47_Data_byte_7_SHIFT)) & CAN_WMBn_D47_Data_byte_7_MASK)

#define CAN_WMBn_D47_Data_byte_6_MASK        (0xFF00U)
#define CAN_WMBn_D47_Data_byte_6_SHIFT       (8U)
#define CAN_WMBn_D47_Data_byte_6_WIDTH       (8U)
#define CAN_WMBn_D47_Data_byte_6(x)          (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D47_Data_byte_6_SHIFT)) & CAN_WMBn_D47_Data_byte_6_MASK)

#define CAN_WMBn_D47_Data_byte_5_MASK        (0xFF0000U)
#define CAN_WMBn_D47_Data_byte_5_SHIFT       (16U)
#define CAN_WMBn_D47_Data_byte_5_WIDTH       (8U)
#define CAN_WMBn_D47_Data_byte_5(x)          (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D47_Data_byte_5_SHIFT)) & CAN_WMBn_D47_Data_byte_5_MASK)

#define CAN_WMBn_D47_Data_byte_4_MASK        (0xFF000000U)
#define CAN_WMBn_D47_Data_byte_4_SHIFT       (24U)
#define CAN_WMBn_D47_Data_byte_4_WIDTH       (8U)
#define CAN_WMBn_D47_Data_byte_4(x)          (((uint32_t)(((uint32_t)(x)) << CAN_WMBn_D47_Data_byte_4_SHIFT)) & CAN_WMBn_D47_Data_byte_4_MASK)
/*! @} */

/*! @name FDCTRL - CAN FD Control Register */
/*! @{ */

#define CAN_FDCTRL_TDCVAL_MASK               (0x3FU)
#define CAN_FDCTRL_TDCVAL_SHIFT              (0U)
#define CAN_FDCTRL_TDCVAL_WIDTH              (6U)
#define CAN_FDCTRL_TDCVAL(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_TDCVAL_SHIFT)) & CAN_FDCTRL_TDCVAL_MASK)

#define CAN_FDCTRL_TDCOFF_MASK               (0x1F00U)
#define CAN_FDCTRL_TDCOFF_SHIFT              (8U)
#define CAN_FDCTRL_TDCOFF_WIDTH              (5U)
#define CAN_FDCTRL_TDCOFF(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_TDCOFF_SHIFT)) & CAN_FDCTRL_TDCOFF_MASK)

#define CAN_FDCTRL_TDCFAIL_MASK              (0x4000U)
#define CAN_FDCTRL_TDCFAIL_SHIFT             (14U)
#define CAN_FDCTRL_TDCFAIL_WIDTH             (1U)
#define CAN_FDCTRL_TDCFAIL(x)                (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_TDCFAIL_SHIFT)) & CAN_FDCTRL_TDCFAIL_MASK)

#define CAN_FDCTRL_TDCEN_MASK                (0x8000U)
#define CAN_FDCTRL_TDCEN_SHIFT               (15U)
#define CAN_FDCTRL_TDCEN_WIDTH               (1U)
#define CAN_FDCTRL_TDCEN(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_TDCEN_SHIFT)) & CAN_FDCTRL_TDCEN_MASK)

#define CAN_FDCTRL_MBDSR0_MASK               (0x30000U)
#define CAN_FDCTRL_MBDSR0_SHIFT              (16U)
#define CAN_FDCTRL_MBDSR0_WIDTH              (2U)
#define CAN_FDCTRL_MBDSR0(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_MBDSR0_SHIFT)) & CAN_FDCTRL_MBDSR0_MASK)

#define CAN_FDCTRL_FDRATE_MASK               (0x80000000U)
#define CAN_FDCTRL_FDRATE_SHIFT              (31U)
#define CAN_FDCTRL_FDRATE_WIDTH              (1U)
#define CAN_FDCTRL_FDRATE(x)                 (((uint32_t)(((uint32_t)(x)) << CAN_FDCTRL_FDRATE_SHIFT)) & CAN_FDCTRL_FDRATE_MASK)
/*! @} */

/*! @name FDCBT - CAN FD Bit Timing Register */
/*! @{ */

#define CAN_FDCBT_FPSEG2_MASK                (0x7U)
#define CAN_FDCBT_FPSEG2_SHIFT               (0U)
#define CAN_FDCBT_FPSEG2_WIDTH               (3U)
#define CAN_FDCBT_FPSEG2(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FPSEG2_SHIFT)) & CAN_FDCBT_FPSEG2_MASK)

#define CAN_FDCBT_FPSEG1_MASK                (0xE0U)
#define CAN_FDCBT_FPSEG1_SHIFT               (5U)
#define CAN_FDCBT_FPSEG1_WIDTH               (3U)
#define CAN_FDCBT_FPSEG1(x)                  (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FPSEG1_SHIFT)) & CAN_FDCBT_FPSEG1_MASK)

#define CAN_FDCBT_FPROPSEG_MASK              (0x7C00U)
#define CAN_FDCBT_FPROPSEG_SHIFT             (10U)
#define CAN_FDCBT_FPROPSEG_WIDTH             (5U)
#define CAN_FDCBT_FPROPSEG(x)                (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FPROPSEG_SHIFT)) & CAN_FDCBT_FPROPSEG_MASK)

#define CAN_FDCBT_FRJW_MASK                  (0x70000U)
#define CAN_FDCBT_FRJW_SHIFT                 (16U)
#define CAN_FDCBT_FRJW_WIDTH                 (3U)
#define CAN_FDCBT_FRJW(x)                    (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FRJW_SHIFT)) & CAN_FDCBT_FRJW_MASK)

#define CAN_FDCBT_FPRESDIV_MASK              (0x3FF00000U)
#define CAN_FDCBT_FPRESDIV_SHIFT             (20U)
#define CAN_FDCBT_FPRESDIV_WIDTH             (10U)
#define CAN_FDCBT_FPRESDIV(x)                (((uint32_t)(((uint32_t)(x)) << CAN_FDCBT_FPRESDIV_SHIFT)) & CAN_FDCBT_FPRESDIV_MASK)
/*! @} */

/*! @name FDCRC - CAN FD CRC Register */
/*! @{ */

#define CAN_FDCRC_FD_TXCRC_MASK              (0x1FFFFFU)
#define CAN_FDCRC_FD_TXCRC_SHIFT             (0U)
#define CAN_FDCRC_FD_TXCRC_WIDTH             (21U)
#define CAN_FDCRC_FD_TXCRC(x)                (((uint32_t)(((uint32_t)(x)) << CAN_FDCRC_FD_TXCRC_SHIFT)) & CAN_FDCRC_FD_TXCRC_MASK)

#define CAN_FDCRC_FD_MBCRC_MASK              (0x7F000000U)
#define CAN_FDCRC_FD_MBCRC_SHIFT             (24U)
#define CAN_FDCRC_FD_MBCRC_WIDTH             (7U)
#define CAN_FDCRC_FD_MBCRC(x)                (((uint32_t)(((uint32_t)(x)) << CAN_FDCRC_FD_MBCRC_SHIFT)) & CAN_FDCRC_FD_MBCRC_MASK)
/*! @} */

#endif /* CAN_REG_H */
